SELECT 
科目代码,科目名称,sum(本位币货币期初),sum(本位货币期末)
FROM 科目余额表
--where 科目名称 like '%其他应收款%'  
where left(科目代码,4)='1231'
group by 科目代码,科目名称
--1231


SELECT 
sum(本位币货币期初),sum(本位货币期末)
FROM 科目余额表
where left(科目代码,4)='1231' and 科目代码!='12319900'
---1027999.52	1843049.41


--select 1842999.25-1843049.41 #期末不含汇兑调整


--12310110	其他应收款-单位-非关联	159271.04	123127.31
--12310190	其他应收款-押金	-41150.00	-41150.00
--12410030	坏账准备-其他应收款	-366968.23	-413587.64
--12310010	其他应收款-个人	-1146023.20	1761021.94
--12318900	其他应收款-汇兑调整	-97.36	50.16
--67020110	信用减值损失-其他应收款减值损失	0.00	46619.41
--12311090	其他应收款-出口退税	0.00	0.00
--12319900	其他应收款-重分类调整	2063602392.21	1791666526.02

--不含坏账准备 
 

WITH t1 AS --本年期末余额 其他应收
(
select 客商代码 编码,客商名称 供应商名称,原币符号 币种,
sum(本位币余额) 期末余额,
sum(原币余额) 期末余额_原币
from 往来余额
where left(科目代码,4)='1231' and 期间_add='this' 
group by 客商代码,客商名称,原币符号
)
select sum(期末余额) from t1

