-- %%%%%%%%%%%%%%%%%%%%%%%%%%AR adj%%%%%%%%%%%%%%%%%%%%%%%%%%
--"应收账款明细表_调整后"
CREATE OR REPLACE VIEW "应收账款明细表_调整后" AS
with t1 as
(
select 
a.*,
coalesce(b.调整金额,0)  总账调整,
coalesce(c.调整金额,0)  其他调整,
from 应收账款明细表 a
left join 总账调整_应收账款 b on a.币种 = b.币种 and a.客商代码 = b.编码
left join 返利调整_应收账款 c on a.币种 = c.币种 and a.客商代码 = c.编码
)
select 
科目代码,科目名称,客商代码,对方单位,期初余额,本期增加,本期减少,期末余额,
汇率调整,
(case when (期末余额+汇率调整+总账调整+其他调整) < 0 
then -1*(期末余额+汇率调整+总账调整+其他调整) else 0 end) as 重分类调整,
总账调整,其他调整,
期末余额+汇率调整+(case when (期末余额+汇率调整+总账调整+其他调整) < 0 
then -1*(期末余额+汇率调整+总账调整+其他调整) else 0 end)+总账调整+其他调整 报表金额,
币种,
case when (期末余额+汇率调整+总账调整+其他调整)<0 then 0 else 原币金额 end as 原币金额 
from t1;


--"应收账款明细表-外币倒轧_调整后"
CREATE OR REPLACE VIEW "应收账款明细表-外币倒轧_调整后" AS
with t1 as
(
select 
a.*,
coalesce(b.调整金额,0)  总账调整,
coalesce(c.调整金额,0)  其他调整,
from "应收账款明细表-外币倒轧" a
left join 总账调整_应收账款 b on a.币种 = b.币种 and a.客商代码 = b.编码
left join 返利调整_应收账款 c on a.币种 = c.币种 and a.客商代码 = c.编码
)
select 
科目代码,科目名称,客商代码,对方单位,期初余额,本期增加,本期减少,期末余额,
汇率调整,
(case when (期末余额+汇率调整+总账调整+其他调整) < 0 
then -1*(期末余额+汇率调整+总账调整+其他调整) else 0 end) as 重分类调整,
总账调整,其他调整,
期末余额+汇率调整+(case when (期末余额+汇率调整+总账调整+其他调整) < 0 
then -1*(期末余额+汇率调整+总账调整+其他调整) else 0 end)+总账调整+其他调整 报表金额,
币种,
case when (期末余额+汇率调整+总账调整+其他调整)<0 then 0 else 原币金额 end as 原币金额 
from t1;


-- "预收账款明细表_调整后"
CREATE OR REPLACE VIEW "预收账款明细表_调整后" AS
with pre_ar as
(
select *,
round(case when 币种!='CNY' then 期末未审 else 期末未审/1.13 end,2) as 合同负债,
期末未审-合同负债 as 其他流动负债,
from 
(select 
客商代码 客户编码,
对方单位 客户名称,
'' 关联关系,
'' "内/外销",
-1*期初余额 期初余额,
本期减少 本期增加, 
本期增加 本期减少,
-1*期末余额 期末余额,
-1*汇率调整 汇率调整,
-1*总账调整 总账调整,
-1*其他调整 其他调整,
-1*期末余额 +-1*汇率调整+-1*总账调整+-1*其他调整 期末未审,
币种 币种,
-1*原币金额 "期末余额（原币）"
from 应收账款明细表_调整后
where 重分类调整 > 0)t
)
select * from pre_ar;


-- "预收账款明细表-外币倒轧_调整后"
CREATE OR REPLACE VIEW "预收账款明细表-外币倒轧_调整后" AS
with pre_ar as
(
select *,
round(case when 币种!='CNY' then 期末未审 else 期末未审/1.13 end,2) as 合同负债,
期末未审-合同负债 as 其他流动负债,
from 
(
select 
客商代码 客户编码,
对方单位 客户名称,
'' 关联关系,
'' "内/外销",
-1*期初余额 期初余额,
本期减少 本期增加, 
本期增加 本期减少,
-1*期末余额 期末余额,
-1*汇率调整 汇率调整,
-1*总账调整 总账调整,
-1*其他调整 其他调整,
-1*期末余额 +-1*汇率调整+-1*总账调整+-1*其他调整 期末未审,
币种 币种,
-1*原币金额 "期末余额（原币）"
from 应收账款明细表_调整后
where 重分类调整 > 0)t
)
select * from pre_ar;